/**
 * 변수(variable) 와 상수(constant)
 */

// 변수 선언
// var 변수명
//var a;
// 변수 초기화
//a=10;
//a=20;
// 변수 선언과 동시에 초기화
//var a=10; 
//var b="hi";
// 변수 사용
//alert(a) //alert(10)
//alert(b) //alert(hi)

//a=a+10; // a=+10 줄여 쓸수 있다.
//a=b+10; // 복합 대입 연산자가 안됨.

//a=a+1; //a+=1; 또는 a++

//alert(a++); // 선 저장 후 증가
//alert(++a); // 선 증가 후 저장
//alert(a--); // 선 저장 후 감소
//alert(--a); // 선 감소 후 저장

// 변수 a에 저장되어 있는 값을 알림창에 띄워라.
//alert(a);

//상수 선언 
// 상수는 선언만 해서는 안됨. 선언과 동시에 초기화까지 해야함.
const c=100;
c=200;
//상수 초기화
alert(c)