/**
 *
 */
/* "출력"이라는 문자열을 알림창으로 10번 띄우세요!(반복문X)

alert("출력")
alert("출력")
alert("출력")
alert("출력")
alert("출력")
alert("출력")
alert("출력")
alert("출력")
alert("출력")
alert("출력")
*/
/*
"출력"이라는 문자열을 알림창으로 10번 띄우세요!
         1     2     4
               5     7
               8     10 
               11    13 
               14    16
               17    19
               20    22
               23    25
               26    28
               29    31
               32      
for(let i=0 ; i<10 ; i++){
    alert("출력"+i)  //3  6  9  12  15  18  21  24  27  30
}  */


/*let i=0

while(i<10){
    alert("출력"+i)
    i++
}


while(true){
    if(내가 졌으면){
        반복문을 끝내라.
    }
}*/

/* break*/
/*
for(let i=0;i<10;i++){
    alert(i+"번째 반복문입니다.");

    if(!confirm("계속하시겠습니까?")){ // 진행여부를 물어봐서 진행하지 않겠다고 하면
        break;//반복을 멈추어라.
    }
}

alert("프로그램 종료")*/
//1-10까지 짝수만 알림창으로 알리기
/*
for(let i=1; i<=10; i++){
    //i가 홀수이면 
    if(i%2==1){
         //멈추고 다시 실행.
        continue;
    }
    alert(i);
}*/


// 중첩for문
//        1     2    
//              19   18
for(var i=1 ; i<3 ; i++){
//             3     4     
//                   7     6    
//                   10    9       
//                   13    12
//                   16    15   
//             20    21  
    for(var j =1 ; j<5 ; j++){
        alert(i+"-"+j)  //   5 8 11 14 22
    }
    alert(i+"번째 반복문이 끝났습니다.") //   17
}
//가장 안쪽의 for문이 끝나야 바깥쪽 for문이 실행됨.
