/**
 * 
 */

// 1. 다음 코드의 실행 결과를 적고 , 왜 그러한 결과가 나오는지 서술하시오.

//1.1 alert(52+273)
// 325 (숫자열 더하기 숫자열)
//1.2 alert('52'+273)
// 52273 (문자열 결합 숫자열)
//1.3 alert(52+'273')
// 52273 (숫자열 결합 문자열)
//1.4 alert('52'+'273')
// 52273 (문자열 결합 문자열)
//1.5 alert(52+3*2)
// 58 (숫자열 더하기 숫자열 곱하기 숫자열)
//1.6 alert(10>5)
// true (숫자열10 비교 숫자열5 10의 더 큰 숫자이므로 true)
//1.7 alert(10<5)
// false (숫자열10 비교 숫자열5 10의 더 큰 숫자이므로 false)
//1.8 alert(5>=5)
// true (숫자열5 비교 숫자열5 5는 5보다 크거나 같으므로 true)
//1.9 alert('12'==12)
// true (문자열 12 같다 숫자열12 12와 12는 같으므로 true)

//1.10 9번에서 다른 결과가 나오게 식을 작성해보세요.
//alert('12'===12)
//===를 쓰면두수나 변수가 같은지 확인하지만 자료형이 다를경우 값이 같아도 false로 변환된 값이 나옴)

//1.11 alert(10>5 && 20>5)
//true ( 10은 5보다 크고 20또한 5보다 크므로 true)

//1.12 alert(10>=10 && 20>30)
//false (10은 10과 크거나 같지만 20은 30보다 작으므로 false)
//1.13 alert(10>5||20>30)
//true (10은 5보다 크고 20은 30작지만 둘중 하나가 참이므로 true)

alert("소연소연")
alert("멍충멍충")

