/**
 *
 */
// 1.변수명을 carName으로 지정하고 Volvo 값을 저장하는 변수를 선언하세요.
//var carName="Volvo";


// 2. x라는 변수를 선언하고 값  50을 저장하세요.
//var x;
//x=50;

// 3. 두 개의 변수 x와 y를 사용하여 5+10의 합을 알림창에 표시하세요.
//var x=5;
//var y=10;

//alert(x+y);

// 4.z라는 변수를 작성하고 x+y를 지정하고 결과를 알림창에 표시하세요.
//z=x+y;

//alert(z)

// 5. 삭제하시겠습니까 창 띄고 확인-> 삭제됨 취소->취소됨
//var result=confirm("진짜로 삭세하시겠습니까?")

//if(result) {  alert("삭제됨")}
//else{  alert("취소됨")}

// 5번 삼황연산자로 풀이-------------------------------------------

//let result=confirm("진짜로 삭제하시겠습니까?")

//result?alert("삭제됨"):alert("취소됨")

//-------------------------------------------------------------------------

//  6. 첫번째 prompt 입력값과 두번째 prompt값의 합을 알림창에 띄우세요.
//let str1 = prompt("몇","");
//let str2 =  prompt ("더하기","")

//let num1;
//let num2;

//num1 = Number(str1)
//num2 = Number(str2)

//alert(num1+num2) 

//---------------------------------------------------------------------------

// 7. prompt창에 나이를 입력하고 19세 이상이면 인증됨으로 알림창을 띄우세요

//let str1 = prompt("나이","")

//let num1;

//if(str1>=19){
    //alert('인증됨')
//}else{
    //alert('인증되지 않음')
//}

